---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarContainerParameterManager.IsParameterOverridden(Autodesk.Revit.DB.ElementId)
source: html/329a5321-cfa1-3924-e05b-6a51fcc08b81.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerParameterManager.IsParameterOverridden Method

Checks if the parameter has an override

## Syntax (C#)
```csharp
public bool IsParameterOverridden(
	ElementId paramId
)
```

## Parameters
- **paramId** (`Autodesk.Revit.DB.ElementId`) - The id of the parameter element

## Returns
True if the parameter has an override

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null